{
  "casual": [
    {
      "id": "casual1",
      "title": "Meeting a Friend",
      "dialogue": [
        {"user": "Hi, it's been a while! How have you been?", "app": "Hey! I've been good, just busy with work. How about you?"},
        {"user": "I've been great, just got back from a vacation.", "app": "That sounds amazing! Where did you go?"},
        {"user": "I went to the beach for a week. It was so relaxing.", "app": "Nice! Which beach did you visit?"},
        {"user": "I visited Miami Beach. The weather was perfect.", "app": "Miami Beach is beautiful. Did you do any activities there?"},
        {"user": "Yes, I did some surfing and sunbathing.", "app": "Surfing sounds fun! Did you take any lessons?"},
        {"user": "No, I already knew how to surf.", "app": "That's impressive! How long have you been surfing?"},
        {"user": "I've been surfing for about five years now.", "app": "Wow, that's quite a while! Any other hobbies?"},
        {"user": "I also like hiking and photography.", "app": "Hiking and photography make a great combo. Any favorite spots?"},
        {"user": "I love hiking in the mountains. The views are incredible.", "app": "Mountains are wonderful for photography. Any plans for the weekend?"},
        {"user": "Not yet, maybe just relax at home. You?", "app": "Same here, just planning to catch up on some reading."}
      ]
    }
  ],
  "work": [
    {
      "id": "work1",
      "title": "Discussing a Project",
      "dialogue": [
        {"user": "Can we discuss the project details now?", "app": "Sure, let's start with the objectives."},
        {"user": "We need to increase user engagement by 20%.", "app": "Got it. Any specific strategies in mind?"},
        {"user": "Yes, we plan to implement a rewards program.", "app": "Sounds good. What rewards are you considering?"},
        {"user": "We're thinking about discounts and exclusive content.", "app": "Great ideas. Any challenges you foresee?"},
        {"user": "Mainly budget constraints.", "app": "Understood. Let's work on a cost-effective plan."},
        {"user": "We'll need marketing support as well.", "app": "I'll coordinate with the marketing team."},
        {"user": "Thanks. We also need to set a timeline.", "app": "How about a three-month timeline?"},
        {"user": "That should work. Let's break it into phases.", "app": "Good idea. I'll draft a phase-wise plan."},
        {"user": "Please share the draft by tomorrow.", "app": "Sure, I'll get it done."},
        {"user": "Thanks for your support.", "app": "You're welcome. Let's make this project a success."}
      ]
    }
  ]
}
